vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32675.pdsc
<?xml version="1.0" encoding="utf-8"?>
<package schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
   <vendor>Maxim</vendor>
   <name>MAX32675</name>
   <url>http://www.mxim.net/microcontroller/pack/</url>
   <description>Maxim Integrated MAX32675 Series Device Support, Board Support Package and Examples</description>
   <supportContact>support@maximintegrated.com</supportContact>

   <license>License/END_USER_LICENSE_AGREEMENT.rtf</license>

   <releases>                  <!-- YYYY-MM-DD -->
      <release version="1.3.2" date="2024-12-04">
        - Updated Keil flash programming algorithm to work with applications larger than 128KB.
      </release> 

      <release version="1.3.1" date="2024-04-24">
        - Updated Keil flash programming algorithm to use word sizes compatible with flash ECC.
      </release> 

      <release version="1.3.0" date="2023-04-13">
        - Fixed one bug and few warnings associated with uart drivers.		
      </release> 
      
      <release version="1.2.0" date="2022-12-06">
        - Updating the C startup file modified and needed for Keil Compiler 6
        - Fixing a bug in UART driver to allow LF to work		
      </release>    
      <release version="1.1.0" date="2022-09-15">
        - Updating to support latest msdk (SDK Libraries) changes.       		
      </release>    
      <release version="1.0.3" date="2021-12-20">
        - This Pack supports both IAR and Keil.
        - Keil Examples support Compiler 6.        		
      </release>    
      <release version="1.0.2" date="2021-10-12">
      	- Pack built with new pack generation tool. 
        - TARGET_REV and TARGET are now part of the preprocessor directive.			
      </release> 
      <release version="1.0.1" date="2021-04-01">
      	- flc_me15.c updated to fix a bug
      </release> 
      <release version="1.0.0" date="2021-03-24">
      	- First Release Merging to MSDK on GIT.  Software merge.
      </release> 
   </releases>

   <keywords>
      <keyword>Maxim</keyword>
      <keyword>MAX32675</keyword>
<!--      <keyword>MAX32676</keyword>	  -->
      <keyword>MAX32675 Evaluation Kit</keyword>
      <keyword>Maxim Device Support</keyword>
      <keyword>Device Support</keyword>
      <keyword>Device Family Package Maxim</keyword>
      <keyword>Maxim Evaluation Kit</keyword>
   </keywords>

   <requirements>
      <languages>
         <language name="C" version="99" />
      </languages>
   </requirements>
   
   <devices>
      <family Dfamily="MAX32675 family" Dvendor="Maxim:23">
         <book name="Doc/MAX32675_datasheet.txt" title="MAX32675 Family Data Sheet"/>
         <book name="Doc/MAX32675_userguide.txt" title="MAX32675 Family Users Guide"/>         
         <compile header="Libraries/CMSIS/Device/Maxim/MAX32675/Include/max32675.h" />
         <compile header="Libraries/CMSIS/Device/Maxim/MAX32675/Include/max32675.h" define="MAX32675"/>
         <memory name="IROM1" access="rx" start="0x10000000" size="0x00060000" startup="1" default="1"/>
         <memory name="IRAM1" access="rwx" start="0x20000000" size="0x00028000" init="0" default="1"/>
         <algorithm name="Flash/MAX32675.FLM" start="0x10000000" size="0x00060000" default="1"/>
         <algorithm  name="FlashIAR/FlashMAX32675.flash" start="0x10000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x00080000" default="0" style="IAR"/>
         <description>
            The MAX32675 is an ultra-low-power, cost-effective, high reliability 32-bit microcontroller enabling designs
            with complex sensor processing without compromising battery life. It combines a flexible and versatile power management
            unit with the powerful Arm Cortex-M4 core with FPU. It also offers legacy designs an easy and cost optimal upgrade path
            from 8- or 16-bit microcontrollers. Error correction coding (ECC) (single error correction double error detection) for flash,
            and SRAM provides extremely reliable code execution. The device integrates up to 384KB of flash memory and 160KB
            (128KB with ECC) of SRAM to accommodate application and sensor code.
            The device features five powerful and flexible power modes. It can operate from a single-supply battery or a dual-supply
            typically provided by a PMIC. The I2C ports support standard, fast, fast-plus, and high-speed modes, operating up to
            3400kbps. The SPI ports can run up to 48MHz in both master and slave mode, and three UARTs can run up to 4000kbaud.
            One low power UART can run up to 1000kbaud. Four general-purpose 32-bit timers, two low power 32-bit timers, two
            windowed watchdog timers, and a real-time clock are also provided. An I2S interface provides digital audio streaming to a
            codec.
         </description>     
     <!--    <feature type="IOs" n="48"/>
         <feature type="NVIC" n="110" name="NVIC"/>
         <feature type="DMA" n="16" name="DMA"/>
         <feature type="Timer" n="6" m="32" name="Timer Module"/>
         <feature type="WDT" n="3"/>
         <feature type="I2C" n="3" name="I2C"/>
         <feature type="SPI" n="3" m="50000000" name="QSPI"/>
         <feature type="UART" n="3" m="3000000" name="High-Speed UART Interface"/>
         <feature type="USBD" n="1" name="High-Speed USB Device"/> -->
         <!--<debug svd="SVD/MAX32675/max32675.svd" /> DELETE -->
		 <debug svd="Libraries/CMSIS/Device/Maxim/MAX32675/Include/max32675.svd" version="1.3.2" />

         <debugport __dp="0">
            <swd idcode="0x2BA01477" />
         </debugport>

         <device Dname="MAX32675">
            <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Pname="Cortex-M4" Punits="2" Dfpu="FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="96000000" />
         </device>
<!--		 
         <device Dname="MAX32676">
            <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Pname="Cortex-M4" Punits="2" Dfpu="FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="96000000" />
            <feature type="Crypto" n="128.256" name="HW Accelerated Trust Protection Unit"/>
         </device>		
-->		 
      </family>
   </devices>

   <!-- MAX32675 Evaluation Kit Board Support Package -->
   <boards>
      <board vendor="Maxim" name="MAX32675 EvKit" revision="Rev A" salesContact="sales@maximintegrated.com">
         <description>The MAX32675 Evaluation Kit provides a convenient platform for evaluating the capabilities of the MAX32675 Family of microcontrollers. The Evaluation Kit also provides a complete, functional system ideal for developing and debugging applications.
         </description>
         <book category="overview" name="Doc/MAX32675_EvKit.txt" title="MAX32675 EvKit Datasheet"/>
         <book category="schematic" name="Doc/MAX32675_EvKitSchematic.txt" title="MAX32675 EvKit Schematic"/>
    <!--     <feature type="PWR" n="5" name="USB Powered"/>
         <feature type="MemCard" n="1" name="SD Card Holder"/>
         <feature type="RAM" n="1" name="128kB SPIXR RAM"/>
         <feature type="ROM" n="1" name="8 MB SPIXF NOR-Flash"/>
         <feature type="USB" n="1" name="High-Speed USB Device, Micro-B receptacle"/>
         <feature type="Button" n="3" name="Push-buttons: Reset, 2x User"/>
         <feature type="LED" n="2" name="User LEDs"/>
         <feature type="GLCD" n="1" m="128.128" name="1.3 inch SPI LCD"/>
         <feature type="LineIn" n="1" name="TRS Audio Jack"/>
         <feature type="LineOut" n="1" name="TRS Audio Jack"/>
         <feature type="AIO" n="8" name="Analog Inputs"/>
         <feature type="DIO" n="16" name="Digital IOs"/> -->
 <!--        <mountedDevice Dvendor="Maxim:23" Dname="MAX32676"/> -->
		 <mountedDevice Dvendor="Maxim:23" Dname="MAX32675"/>
         <debugInterface adapter="CMSIS-DAP" connector="10-pin Cortex Debug Connector (0.05 inch connector)"/>
         <debugInterface adapter="JTAG/SW" connector="20-pin Arm Standard JTAG Connector"/>
      </board>
   </boards>
  
   <!-- Evaluation Kit Example Programs -->
      
   <examples>

      <example name="ADC" doc="ARM/Abstract.txt" folder="Examples/MAX32675/ADC">
         <description>ADC Demo</description>
         <board name="MAX32675 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/ADC.ewp" />
            <environment name="uv" load="ARM/ADC.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32675 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="MAX32675 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>      
  
      <example name="AES" doc="ARM/Abstract.txt" folder="Examples/MAX32675/AES">
         <description>AES Demo</description>
         <board name="MAX32675 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/AES.ewp" />
            <environment name="uv" load="ARM/AES.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32675 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="MAX32675 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>    
	  
      <example name="CRC" doc="ARM/Abstract.txt" folder="Examples/MAX32675/CRC">
         <description>CRC Module Demo</description>
         <board name="MAX32675 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/CRC.ewp" />
            <environment name="uv" load="ARM/CRC.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32675 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="CRC"/>
            <component Cbundle="MAX32675 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>	  
	  
      <example name="DMA" doc="ARM/Abstract.txt" folder="Examples/MAX32675/DMA">
         <description>Direct Memory Access Controller Demo</description>
         <board name="MAX32675 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/DMA.ewp" />
            <environment name="uv" load="ARM/DMA.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32675 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="DMA"/>
            <component Cbundle="MAX32675 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>  
 
      <example name="Flash" doc="ARM/Abstract.txt" folder="Examples/MAX32675/Flash">
         <description>Flash Demo</description>
         <board name="MAX32675 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/Flash.ewp" />
            <environment name="uv" load="ARM/Flash.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32675 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="FLC"/>
            <component Cbundle="MAX32675 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>
 
 	  <example name="GPIO" doc="ARM/Abstract.txt" folder="Examples/MAX32675/GPIO">
         <description>GPIO Demo</description>
         <board name="MAX32675 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/GPIO.ewp" />
            <environment name="uv" load="ARM/GPIO.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32675 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
			<component Cbundle="Maxim API" Cclass="Device" Cgroup="GPIO"/>
            <component Cbundle="MAX32675 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>
	  
      <example name="HART_UART" doc="ARM/Abstract.txt" folder="Examples/MAX32675/HART_UART">
         <description>HART_UART Demo</description>
         <board name="MAX32675 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/HART_UART.ewp" />
            <environment name="uv" load="ARM/HART_UART.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32675 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="MAX32675 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example> 	  
	  
 
      <example name="Hello_World" doc="ARM/Abstract.txt" folder="Examples/MAX32675/Hello_World">
         <description>Hello World Demo</description>
         <board name="MAX32675 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/Hello_World.ewp" />
            <environment name="uv" load="ARM/Hello_World.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32675 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32675 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>
	  
      <example name="I2C" doc="ARM/Abstract.txt" folder="Examples/MAX32675/I2C">
         <description>I2C Demo</description>
         <board name="MAX32675 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/I2C.ewp" />
            <environment name="uv" load="ARM/I2C.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32675 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="I2C"/>
            <component Cbundle="MAX32675 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>

