vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32675.pdsc
      <example name="I2S" doc="ARM/Abstract.txt" folder="Examples/MAX32675/I2S">
         <description>I2S Demo</description>
         <board name="MAX32675 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/I2S.ewp" />
            <environment name="uv" load="ARM/I2S.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32675 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="I2S"/>
            <component Cbundle="MAX32675 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>
	  
   </examples>

   <conditions>
      <!-- MAX32675 Device Condition -->
      <condition id="MAX32675 Family">
         <description> Maxim Integrated MAX32675 device family</description>
         <require Dvendor="Maxim:23"/>
		 <require Dname="MAX32675"/>
         <!-- <require Dfamily="MAX32675-76"/> -->
      </condition>

      <!-- MAX32675 Device Condition -->
      <condition id="MAX32675 Device">
         <description> Maxim Integrated MAX32675 device family</description>
         <require Dvendor="Maxim:23"/>
         <require Dname="MAX32675"/>
      </condition>


      <!-- MAX32676 Device Condition -->
<!--      <condition id="MAX32676 Device">
         <description> Maxim Integrated MAX32675 device family</description>
         <require Dvendor="Maxim:23"/>
         <require Dname="MAX32676"/>
      </condition> -->

      <!-- MAX32675/51/52 CMSIS-CORE Condition -->
      <condition id="MAX32675 CMSIS-CORE">
         <description>Maxim MAX32675 Series devices and CMSIS-CORE</description>
         <require Cclass="CMSIS" Cgroup="CORE"/>
         <require condition="MAX32675 Family"/>
     <!--    <accept condition="MAX32676 Device"/> -->
		 <accept condition="MAX32675 Device"/>
         <require Cclass="Device" Cgroup="Startup"/>
      </condition>

      <!-- GNUC/Eclipse Compiler Condition -->
      <condition id="Startup GCC">
         <description>Startup files for the GNU C Toolchain</description>
         <require Tcompiler="GCC"/>
      </condition>

      <!-- IAR Embedded Workbench Compiler Condition -->
      <condition id="Startup ARM">
         <description>Startup files for the KEIL Embedded Workbench Toolchain</description>
         <require Tcompiler="ARMCC"/>
      </condition> 
      <condition id="Startup IAR">
         <description>Startup files for the IAR Embedded Workbench Toolchain</description>
         <require Tcompiler="IAR"/>
      </condition>


      <!-- AES Peripheral Condition -->
      <condition id="MAX32675 CMSIS AES">
         <description>AES Interface</description>
         <require condition="MAX32675 CMSIS-CORE"/>
      </condition>
	  
      <!-- CRC Peripheral Condition -->
      <condition id="MAX32675 CMSIS CRC">
         <description>CRC</description>
         <require condition="MAX32675 CMSIS-CORE"/>
      </condition>	
	
      <!-- AFE Peripheral Condition -->
      <condition id="MAX32675 CMSIS AFE">
         <description>AFE</description>
         <require condition="MAX32675 CMSIS-CORE"/>
      </condition>	
	
      <!-- Standard DMA Peripheral -->
      <condition id="MAX32675 CMSIS DMA">
         <description>Standard DMA</description>
         <require condition="MAX32675 CMSIS-CORE"/>
      </condition>	  

      <!-- FLash Controller Peripheral -->
      <condition id="MAX32675 CMSIS FLC">
         <description>Internal Flash Controller</description>
         <require condition="MAX32675 CMSIS-CORE"/>
         <require condition="MAX32675 CMSIS ICC"/>
      </condition>

      <!-- GPIO -->
      <condition id="MAX32675 CMSIS GPIO">
         <description>GPIO</description>
         <require condition="MAX32675 CMSIS-CORE"/>
      </condition>

      <!-- I2C -->
      <condition id="MAX32675 CMSIS I2C">
         <description>I2C Interface</description>
         <require condition="MAX32675 CMSIS-CORE"/>
      </condition>

      <!-- I2S -->
      <condition id="MAX32675 CMSIS I2S">
         <description>I2S Interface</description>
         <require condition="MAX32675 CMSIS-CORE"/>
      </condition>

      <!-- ICC -->
      <condition id="MAX32675 CMSIS ICC">
         <description>Instruction Cache Controller</description>
         <require condition="MAX32675 CMSIS-CORE"/>
      </condition>

      <!-- Low Power -->
      <condition id="MAX32675 CMSIS Low Power">
         <description>Low Power API</description>
         <require condition="MAX32675 CMSIS-CORE"/>
      </condition>

      <!-- RTC -->
<!--      <condition id="MAX32675 CMSIS RTC">
         <description>Real-Time Clock</description>
         <require condition="MAX32675 CMSIS-CORE"/>
      </condition>
-->
      <!-- SPI Peripheral -->
      <condition id="MAX32675 CMSIS SPI">
         <description>SPI Interface</description>
         <require condition="MAX32675 CMSIS-CORE"/>
      </condition>

      <!-- SYS -->
      <condition id="MAX32675 CMSIS SYS">
         <description>SYS Interface</description>
         <require condition="MAX32675 CMSIS-CORE"/>
      </condition>

      <!-- Timer -->
      <condition id="MAX32675 CMSIS TIMER">
         <description>Timers</description>
         <require condition="MAX32675 CMSIS-CORE"/>
      </condition>

      <!-- TRNG -->
      <condition id="MAX32675 CMSIS TRNG">
         <description>Timers</description>
         <require condition="MAX32675 CMSIS-CORE"/>
      </condition>

      <!-- UART -->
      <condition id="MAX32675 CMSIS UART">
         <description>UART</description>
         <require condition="MAX32675 CMSIS-CORE"/>
      </condition>

      <!-- WDT -->
      <condition id="MAX32675 CMSIS WDT">
         <description>Watchdog Timers</description>
         <require condition="MAX32675 CMSIS-CORE"/>
      </condition>

      <!-- SIMO -->
<!--      <condition id="MAX32675 CMSIS SIMO">
         <description>Single Inductor Multiple Output DC/DC Converter</description>
         <require condition="MAX32675 CMSIS-CORE"/>
      </condition>  -->

      <condition id="MAX32675 BSP DEP">	  
	     <description>Board Support Package</description>
         <!-- <require condition="MAX32675 CMSIS-CORE"/> -->
         <accept condition="MAX32675 Family"/>
         <require Cclass="Device" Cgroup="UART"/>
         <require Cclass="Device" Cgroup="GPIO"/>
      </condition>
	  
