vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32675.pdsc
   </conditions>	  

   <components>
                                                                                
      <!-- <component Cgroup="Rev" Cclass="Target Rev" Cvariant="A1" Cversion="1.3.2" versionMatchMode="fixed" condition="MAX32675 Family"> -->
 <!--      <component Cgroup="Rev" Cclass="Target Rev" Cvariant="A1" Cversion="1.3.2" condition="MAX32675 Family">	  
            <description>Target Rev A1 selected</description>
            <RTE_Components_h>
			 #define TARGET 32675   /* Target Device Part Number */
             #define TARGET_REV 0x4131       /* A1 chip */
            </RTE_Components_h>
       </component>
       <component Cgroup="Rev" Cclass="Target Rev" Cvariant="A2" Cversion="1.3.2" condition="MAX32675 Family">
             <description>Target Rev A2 selected</description>
             <RTE_Components_h>
			 #define TARGET 32675   /* Target Device Part Number */
             #define TARGET_REV 0x4132       /* A2 chip */
             </RTE_Components_h>
        </component> -->

      <bundle Cbundle="Maxim API" Cclass="Device" Cversion="1.3.2">
         <description>Maxim Developed Hardware Abstraction Layer</description>
         <doc>Doc/SDK_Documentation/doxygen.txt</doc>

         <!-- MAX32675 Device Selection -->
         <component Cgroup="Startup" Cversion="1.3.2" condition="MAX32675 Family" >
            <description>System Startup for Maxim MAX32675 Microcontroller</description>
			
			
            <files>
               <!-- Include paths for the tools -->
               <file category="include" name="Libraries/CMSIS/Device/Maxim/MAX32675/Include/" version="1.3.2" />
               <file category="include" name="Libraries/PeriphDrivers/Include/MAX32675/" version="1.3.2" />

			   <file category="include" name="Libraries/PeriphDrivers/Source/AES/" version="1.3.2"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/CRC/" version="1.3.2"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/AFE/" version="1.3.2"/>			   
			   <file category="include" name="Libraries/PeriphDrivers/Source/DMA/" version="1.3.2"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/FLC/" version="1.3.2"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/GPIO/" version="1.3.2"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/I2C/" version="1.3.2"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/I2S/" version="1.3.2"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/ICC/" version="1.3.2"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/LP/" version="1.3.2"/>
			<!--   <file category="include" name="Libraries/PeriphDrivers/Source/RTC/" version="1.3.2"/> -->
			   <file category="include" name="Libraries/PeriphDrivers/Source/SPI/" version="1.3.2"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/SYS/" version="1.3.2"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/TMR/" version="1.3.2"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/TRNG/" version="1.3.2"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/UART/" version="1.3.2"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/WDT/" version="1.3.2"/>

               <!-- Keil/ARM device startup file and sub_main to call SystemInit -->			   
               <file category="sourceAsm" attr="config" version="1.3.2" name="Libraries/CMSIS/Device/Maxim/MAX32675/Source/ARM/startup_max32675.s" condition="Startup ARM" />
                <file category="sourceC" attr="config"  version="1.3.2" name="Libraries/CMSIS/Device/Maxim/MAX32675/Source/IAR/low_level_init.c" condition="Startup IAR" />
				
               <!-- GNUC/Eclipse device startup file -->
               <file category="sourceAsm" attr="config"  version="1.3.2" name="Libraries/CMSIS/Device/Maxim/MAX32675/Source/GCC/startup_max32675.S" condition="Startup GCC" />

               <!-- IAR device startup file, low level init and cmain.s -->  
               <file category="sourceAsm" attr="config" name="Libraries/CMSIS/Device/Maxim/MAX32675/Source/IAR/startup_max32675.s" condition="Startup IAR" version="1.3.2" />
               <file category="sourceC" attr="config"  version="1.3.2" name="Libraries/CMSIS/Device/Maxim/MAX32675/Source/IAR/low_level_init.c" condition="Startup IAR" />
               <file category="sourceAsm" attr="config"  version="1.3.2" name="Libraries/CMSIS/Device/Maxim/MAX32675/Source/IAR/cmain.s" condition="Startup IAR" />

               <!-- System, NVIC and device header files common to all platforms -->
               <file category="sourceC" attr="config"  version="1.3.2" name="Libraries/CMSIS/Device/Maxim/MAX32675/Source/system_max32675.c" />
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/nvic_table.c" version="1.3.2" />
               <file category="header" attr="config" name="Libraries/CMSIS/Device/Maxim/MAX32675/Include/max32675.h" version="1.3.2" />
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/mxc_assert.c"  version="1.3.2" />
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/mxc_delay.c"  version="1.3.2" />
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/mxc_lock.c"  version="1.3.2" />
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/pins_me16.c"  version="1.3.2" />
             <!--  <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/sys_me16.c"  version="1.3.2" />	  --> 
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/nvic_table.c"  version="1.3.2" />		   
            </files>
         </component>

         <component Cgroup="AES" condition="MAX32675 CMSIS AES" Cversion="1.3.2"> 
         	 <description>AES Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/AES/aes_me15.c" version="1.3.2"/>
	           <file category="sourceC" name="Libraries/PeriphDrivers/Source/AES/aes_revb.c" version="1.3.2"/>			   
            </files>
         </component>
		 
		 <component Cgroup="AFE" condition="MAX32675 CMSIS AFE" Cversion="1.3.2"> 
         	 <description>Camera Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/AFE/afe.c" version="1.3.2"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/AFE/afe_gpio.c" version="1.3.2"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/AFE/infoblock.c" version="1.3.2"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/AFE/hart_uart.c" version="1.3.2"/>			   
            </files>
         </component>		 		 
		 
		 <component Cgroup="CRC" condition="MAX32675 CMSIS CRC" Cversion="1.3.2"> 
         	 <description>Camera Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/CRC/crc_me15.c" version="1.3.2"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/CRC/crc_reva.c" version="1.3.2"/>
            </files>
         </component>		 

         <component Cgroup="DMA" condition="MAX32675 CMSIS DMA" Cversion="1.3.2">
            <description>Standard DMA</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/DMA/dma_me15.c" version="1.3.2"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/DMA/dma_reva.c" version="1.3.2"/>
            </files>
         </component>

         <component Cgroup="FLC" condition="MAX32675 CMSIS FLC" Cversion="1.3.2" >
            <description> Flash Controller </description>
            <files>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/FLC/flc_me15.c" version="1.3.2"/>			
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/FLC/flc_common.c" version="1.3.2"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/FLC/flc_reva.c" version="1.3.2"/>					   			   
            </files>
         </component>
		 
		 <component Cgroup="GPIO" condition="MAX32675 CMSIS GPIO" Cversion="1.3.2">
            <description> GPIO </description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/GPIO/gpio_me16.c" version="1.3.2"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/GPIO/gpio_reva.c" version="1.3.2"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/GPIO/gpio_common.c" version="1.3.2"/>		   
            </files>
         </component>
		 
