vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32675.pdsc
        <component Cgroup="I2C" condition="MAX32675 CMSIS I2C" Cversion="1.3.2">
            <description>I2C Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/I2C/i2c_me15.c" version="1.3.2"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/I2C/i2c_reva.c" version="1.3.2"/>			   
            </files>
         </component>		 
		 
        <component Cgroup="I2S" condition="MAX32675 CMSIS I2S" Cversion="1.3.2">
            <description>I2S Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/I2S/i2s_me15.c" version="1.3.2"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/I2S/i2s_reva.c" version="1.3.2"/>			   
            </files>
         </component>		 		 

         <component Cgroup="ICC" condition="MAX32675 CMSIS ICC" Cversion="1.3.2">
            <description>Instruction Cache Controller</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/ICC/icc_me15.c" version="1.3.2"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/ICC/icc_reva.c" version="1.3.2"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/ICC/icc_common.c" version="1.3.2"/>			   
            </files>
         </component>		 
		 
         <component Cgroup="Low Power" condition="MAX32675 CMSIS Low Power" Cversion="1.3.2">
            <description>Low Power API</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/LP/lp_me15.c" version="1.3.2"/>			   
            </files>
         </component>		 

<!--		 
         <component Cgroup="RTC" condition="MAX32675 CMSIS RTC" Cversion="1.3.2">
            <description>Real-Time Clock</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/RTC/rtc_me16.c" version="1.3.2"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/RTC/rtc_reva.c" version="1.3.2"/>			   
            </files>
         </component>
-->
         <component Cgroup="SPI" condition="MAX32675 CMSIS SPI" Cversion="1.3.2">
            <description>SPI Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SPI/spi_me15.c" version="1.3.2"/>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SPI/spi_reva.c" version="1.3.2"/>			   
            </files>
         </component>

         <component Cgroup="SYS" condition="MAX32675 CMSIS SYS" Cversion="1.3.2">
            <description>SYS Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/sys_me15.c" version="1.3.2"/>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/pins_me16.c" version="1.3.2"/>
<!--               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/pins_me13.c" version="1.3.2"/>	-->
<!--               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/pins_es17.c" version="1.3.2"/> -->				   
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/nvic_table.c" version="1.3.2"/>	
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/mxc_lock.c" version="1.3.2"/>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/mxc_delay.c" version="1.3.2"/>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/mxc_assert.c" version="1.3.2"/>

            </files>
         </component>

         <component Cgroup="Timers" condition="MAX32675 CMSIS TIMER" Cversion="1.3.2">
            <description>32-Bit Timers</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/TMR/tmr_me15.c" version="1.3.2"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/TMR/tmr_revb.c" version="1.3.2"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/TMR/tmr_common.c" version="1.3.2"/>			   
            </files>
         </component>

         <component Cgroup="TRNG" condition="MAX32675 CMSIS TRNG" Cversion="1.3.2">
            <description>TRNG</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/TRNG/trng_me15.c" version="1.3.2"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/TRNG/trng_revb.c" version="1.3.2"/>		   
            </files>
         </component>

         <component Cgroup="UART" condition="MAX32675 CMSIS UART" Cversion="1.3.2">
            <description>UART Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/UART/uart_me16.c" version="1.3.2"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/UART/uart_revb.c" version="1.3.2"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/UART/uart_common.c" version="1.3.2"/>
            </files>
         </component>

      <component Cgroup="WDT" condition="MAX32675 CMSIS WDT" Cversion="1.3.2">
            <description>Watchdog Timers</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/WDT/wdt_me15.c" version="1.3.2"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/WDT/wdt_revb.c" version="1.3.2"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/WDT/wdt_common.c" version="1.3.2"/>
            </files>
         </component>		    
      </bundle>
	  
      <bundle Cbundle="MAX32675 BSP" Cclass="BSP" Cversion="1.3.2">
         <description>MAX32675 Evaluation Kit Board Support Package</description>
         <doc>Doc/MAX32675_EvKit.txt</doc>
            <component Cgroup="EvKit V1" condition="MAX32675 BSP DEP">
		    <!-- <component Cgroup="EvKit V1"> -->
            <description>MAX32675 Evaluation Kit Board Setup</description>
            <RTE_Components_h>
               #define BOARD EvKit_V1 /* Target Board */
            </RTE_Components_h>
            <files>
			   <file category="include" name="Libraries/Boards/MAX32675/EvKit_V1/Include/" version="1.3.2"/>
               <file category="sourceC" name="Libraries/Boards/MAX32675/EvKit_V1/Source/board.c" version="1.3.2"/>	   			   
               <file category="include" name="Libraries/Boards/MAX32675/Include/" version="1.3.2"/>
               <file category="sourceC" name="Libraries/Boards/MAX32675/Source/led.c" version="1.3.2"/>
               <file category="sourceC" name="Libraries/Boards/MAX32675/Source/pb.c" version="1.3.2"/>
               <file category="sourceC" name="Libraries/Boards/MAX32675/Source/stdio.c" version="1.3.2"/>
           </files>
         </component>
      </bundle> 
   </components>
</package>